README.org
* Introduction

This repository uses different languages to demonstrate /[[https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life][Conway's Game of Life]]/.

All the program accepts 2 arguments: size of board and number of initial random cells.

They will run for 100000 rounds and exit.

It is created for 2 purposes:

1. Provide a hello-word example.

2. Provide a minimal benchmark.

* Hierarchy

Each directory under root (this one) contains code written in one specific language.

* How to run

** Common Lisp

1. Install roswell

2. Run "life-game.ros".

** Julia
