README.md

# Table of Contents

1.  [Introduction](#org7cf0dc0)
2.  [Hierarchy](#org6dd263d)
3.  [How to run](#org6be10fa)
    1.  [Common Lisp](#orgcc9fc74)
    2.  [Julia](#orgbc628dc)


<a id="org7cf0dc0"></a>

# Introduction

This repository uses different languages to demonstrate *[Conway's Game of Life](https://en.wikipedia.org/wiki/Conway%27s_Game_of_Life)*.

All the program accepts 2 arguments: size of board and number of initial random cells.

They will run for 100000 rounds and exit.

It is created for 2 purposes:

1.  Provide a hello-word example.

2.  Provide a minimal benchmark.


<a id="org6dd263d"></a>

# Hierarchy

Each directory under root (this one) contains code written in one specific language.


<a id="org6be10fa"></a>

# How to run


<a id="orgcc9fc74"></a>

## Common Lisp

1.  Install roswell

2.  Run "life-game.ros".


<a id="orgbc628dc"></a>

## Julia

